{"site_title":"ArxivDaily","project_name":"notfeed","project_version":"0.2.9","project_homepage":"https://github.com/NotCraft/NotFeed","days":[{"datetime":"2023-03-08T01:30:00Z","channels":[{"title":"cs.CL updates on arXiv.org","link":"http://export.arxiv.org/rss/cs.CL","description":"Computer Science -- Computation and Language (cs.CL) updates on the arXiv.org e-print archive","language":null,"copyright":null,"managing_editor":null,"webmaster":null,"pub_date":null,"last_build_date":null,"categories":[],"generator":null,"docs":null,"cloud":null,"rating":null,"ttl":null,"image":{"url":"http://arxiv.org/icons/sfx.gif","title":"arXiv.org","link":"http://arxiv.org/","width":null,"height":null,"description":null},"text_input":null,"skip_hours":[],"skip_days":[],"items":[{"title":"CoSyn: Detecting Implicit Hate Speech in Online Conversations Using a Context Synergized Hyperbolic Network. (arXiv:2303.03387v1 [cs.LG])","link":"http://arxiv.org/abs/2303.03387","description":"<p>The tremendous growth of social media users interacting in online\nconversations has also led to significant growth in hate speech. Most of the\nprior works focus on detecting explicit hate speech, which is overt and\nleverages hateful phrases, with very little work focusing on detecting hate\nspeech that is implicit or denotes hatred through indirect or coded language.\nIn this paper, we present CoSyn, a user- and conversational-context synergized\nnetwork for detecting implicit hate speech in online conversation trees. CoSyn\nfirst models the user's personal historical and social context using a novel\nhyperbolic Fourier attention mechanism and hyperbolic graph convolution\nnetwork. Next, we jointly model the user's personal context and the\nconversational context using a novel context interaction mechanism in the\nhyperbolic space that clearly captures the interplay between the two and makes\nindependent assessments on the amounts of information to be retrieved from both\ncontexts. CoSyn performs all operations in the hyperbolic space to account for\nthe scale-free dynamics of social media. We demonstrate the effectiveness of\nCoSyn both qualitatively and quantitatively on an open-source hate speech\ndataset with Twitter conversations and show that CoSyn outperforms all our\nbaselines in detecting implicit hate speech with absolute improvements in the\nrange of 8.15% - 19.50%.\n</p>","author":null,"categories":[],"comments":null,"enclosure":null,"guid":null,"pub_date":null,"source":null,"content":null,"extensions":{},"itunes_ext":null,"dublin_core_ext":{"contributors":[],"coverages":[],"creators":["<a href=\"http://arxiv.org/find/cs/1/au:+Ghosh_S/0/1/0/all/0/1\">Sreyan Ghosh</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Suri_M/0/1/0/all/0/1\">Manan Suri</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Chiniya_P/0/1/0/all/0/1\">Purva Chiniya</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Tyagi_U/0/1/0/all/0/1\">Utkarsh Tyagi</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Kumar_S/0/1/0/all/0/1\">Sonal Kumar</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Manocha_D/0/1/0/all/0/1\">Dinesh Manocha</a>"],"dates":[],"descriptions":[],"formats":[],"identifiers":[],"languages":[],"publishers":[],"relations":[],"rights":[],"sources":[],"subjects":[],"titles":[],"types":[]}},{"title":"Spelling convention sensitivity in neural language models. (arXiv:2303.03457v1 [cs.CL])","link":"http://arxiv.org/abs/2303.03457","description":"<p>We examine whether large neural language models, trained on very large\ncollections of varied English text, learn the potentially long-distance\ndependency of British versus American spelling conventions, i.e., whether\nspelling is consistently one or the other within model-generated strings. In\ncontrast to long-distance dependencies in non-surface underlying structure\n(e.g., syntax), spelling consistency is easier to measure both in LMs and the\ntext corpora used to train them, which can provide additional insight into\ncertain observed model behaviors. Using a set of probe words unique to either\nBritish or American English, we first establish that training corpora exhibit\nsubstantial (though not total) consistency. A large T5 language model does\nappear to internalize this consistency, though only with respect to observed\nlexical items (not nonce words with British/American spelling patterns). We\nfurther experiment with correcting for biases in the training data by\nfine-tuning T5 on synthetic data that has been debiased, and find that\nfinetuned T5 remains only somewhat sensitive to spelling consistency. Further\nexperiments show GPT2 to be similarly limited.\n</p>","author":null,"categories":[],"comments":null,"enclosure":null,"guid":null,"pub_date":null,"source":null,"content":null,"extensions":{},"itunes_ext":null,"dublin_core_ext":{"contributors":[],"coverages":[],"creators":["<a href=\"http://arxiv.org/find/cs/1/au:+Nielsen_E/0/1/0/all/0/1\">Elizabeth Nielsen</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Kirov_C/0/1/0/all/0/1\">Christo Kirov</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Roark_B/0/1/0/all/0/1\">Brian Roark</a>"],"dates":[],"descriptions":[],"formats":[],"identifiers":[],"languages":[],"publishers":[],"relations":[],"rights":[],"sources":[],"subjects":[],"titles":[],"types":[]}},{"title":"Can an Embodied Agent Find Your \"Cat-shaped Mug\"? LLM-Based Zero-Shot Object Navigation. (arXiv:2303.03480v1 [cs.RO])","link":"http://arxiv.org/abs/2303.03480","description":"<p>We present LGX, a novel algorithm for Object Goal Navigation in a\n\"language-driven, zero-shot manner\", where an embodied agent navigates to an\narbitrarily described target object in a previously unexplored environment. Our\napproach leverages the capabilities of Large Language Models (LLMs) for making\nnavigational decisions by mapping the LLMs implicit knowledge about the\nsemantic context of the environment into sequential inputs for robot motion\nplanning. Simultaneously, we also conduct generalized target object detection\nusing a pre-trained Vision-Language grounding model. We achieve\nstate-of-the-art zero-shot object navigation results on RoboTHOR with a success\nrate (SR) improvement of over 27% over the current baseline of the OWL-ViT CLIP\non Wheels (OWL CoW). Furthermore, we study the usage of LLMs for robot\nnavigation and present an analysis of the various semantic factors affecting\nmodel output. Finally, we showcase the benefits of our approach via real-world\nexperiments that indicate the superior performance of LGX when navigating to\nand detecting visually unique objects.\n</p>","author":null,"categories":[],"comments":null,"enclosure":null,"guid":null,"pub_date":null,"source":null,"content":null,"extensions":{},"itunes_ext":null,"dublin_core_ext":{"contributors":[],"coverages":[],"creators":["<a href=\"http://arxiv.org/find/cs/1/au:+Dorbala_V/0/1/0/all/0/1\">Vishnu Sashank Dorbala</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Mullen_J/0/1/0/all/0/1\">James F. Mullen Jr.</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Manocha_D/0/1/0/all/0/1\">Dinesh Manocha</a>"],"dates":[],"descriptions":[],"formats":[],"identifiers":[],"languages":[],"publishers":[],"relations":[],"rights":[],"sources":[],"subjects":[],"titles":[],"types":[]}},{"title":"Two-stage Pipeline for Multilingual Dialect Detection. (arXiv:2303.03487v1 [cs.CL])","link":"http://arxiv.org/abs/2303.03487","description":"<p>Dialect Identification is a crucial task for localizing various Large\nLanguage Models. This paper outlines our approach to the VarDial 2023 shared\ntask. Here we have to identify three or two dialects from three languages each\nwhich results in a 9-way classification for Track-1 and 6-way classification\nfor Track-2 respectively. Our proposed approach consists of a two-stage system\nand outperforms other participants' systems and previous works in this domain.\nWe achieve a score of 58.54% for Track-1 and 85.61% for Track-2. Our codebase\nis available publicly (https://github.com/ankit-vaidya19/EACL_VarDial2023).\n</p>","author":null,"categories":[],"comments":null,"enclosure":null,"guid":null,"pub_date":null,"source":null,"content":null,"extensions":{},"itunes_ext":null,"dublin_core_ext":{"contributors":[],"coverages":[],"creators":["<a href=\"http://arxiv.org/find/cs/1/au:+Vaidya_A/0/1/0/all/0/1\">Ankit Vaidya</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Kane_A/0/1/0/all/0/1\">Aditya Kane</a>"],"dates":[],"descriptions":[],"formats":[],"identifiers":[],"languages":[],"publishers":[],"relations":[],"rights":[],"sources":[],"subjects":[],"titles":[],"types":[]}},{"title":"Guilt Detection in Text: A Step Towards Understanding Complex Emotions. (arXiv:2303.03510v1 [cs.CL])","link":"http://arxiv.org/abs/2303.03510","description":"<p>We introduce a novel Natural Language Processing (NLP) task called Guilt\ndetection, which focuses on detecting guilt in text. We identify guilt as a\ncomplex and vital emotion that has not been previously studied in NLP, and we\naim to provide a more fine-grained analysis of it. To address the lack of\npublicly available corpora for guilt detection, we created VIC, a dataset\ncontaining 4622 texts from three existing emotion detection datasets that we\nbinarized into guilt and no-guilt classes. We experimented with traditional\nmachine learning methods using bag-of-words and term frequency-inverse document\nfrequency features, achieving a 72% f1 score with the highest-performing model.\nOur study provides a first step towards understanding guilt in text and opens\nthe door for future research in this area.\n</p>","author":null,"categories":[],"comments":null,"enclosure":null,"guid":null,"pub_date":null,"source":null,"content":null,"extensions":{},"itunes_ext":null,"dublin_core_ext":{"contributors":[],"coverages":[],"creators":["<a href=\"http://arxiv.org/find/cs/1/au:+Meque_A/0/1/0/all/0/1\">Abdul Gafar Manuel Meque</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Hussain_N/0/1/0/all/0/1\">Nisar Hussain</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Sidorov_G/0/1/0/all/0/1\">Grigori Sidorov</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Gelbukh_A/0/1/0/all/0/1\">Alexander Gelbukh</a>"],"dates":[],"descriptions":[],"formats":[],"identifiers":[],"languages":[],"publishers":[],"relations":[],"rights":[],"sources":[],"subjects":[],"titles":[],"types":[]}},{"title":"Multi-resolution Interpretation and Diagnostics Tool for Natural Language Classifiers. (arXiv:2303.03542v1 [cs.CL])","link":"http://arxiv.org/abs/2303.03542","description":"<p>Developing explainability methods for Natural Language Processing (NLP)\nmodels is a challenging task, for two main reasons. First, the high\ndimensionality of the data (large number of tokens) results in low coverage and\nin turn small contributions for the top tokens, compared to the overall model\nperformance. Second, owing to their textual nature, the input variables, after\nappropriate transformations, are effectively binary (presence or absence of a\ntoken in an observation), making the input-output relationship difficult to\nunderstand. Common NLP interpretation techniques do not have flexibility in\nresolution, because they usually operate at word-level and provide fully local\n(message level) or fully global (over all messages) summaries. The goal of this\npaper is to create more flexible model explainability summaries by segments of\nobservation or clusters of words that are semantically related to each other.\nIn addition, we introduce a root cause analysis method for NLP models, by\nanalyzing representative False Positive and False Negative examples from\ndifferent segments. At the end, we illustrate, using a Yelp review data set\nwith three segments (Restaurant, Hotel, and Beauty), that exploiting\ngroup/cluster structures in words and/or messages can aid in the interpretation\nof decisions made by NLP models and can be utilized to assess the model's\nsensitivity or bias towards gender, syntax, and word meanings.\n</p>","author":null,"categories":[],"comments":null,"enclosure":null,"guid":null,"pub_date":null,"source":null,"content":null,"extensions":{},"itunes_ext":null,"dublin_core_ext":{"contributors":[],"coverages":[],"creators":["<a href=\"http://arxiv.org/find/cs/1/au:+Jalali_P/0/1/0/all/0/1\">Peyman Jalali</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Zhou_N/0/1/0/all/0/1\">Nengfeng Zhou</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Yu_Y/0/1/0/all/0/1\">Yufei Yu</a>"],"dates":[],"descriptions":[],"formats":[],"identifiers":[],"languages":[],"publishers":[],"relations":[],"rights":[],"sources":[],"subjects":[],"titles":[],"types":[]}},{"title":"Large Language Models as Zero-Shot Human Models for Human-Robot Interaction. (arXiv:2303.03548v1 [cs.RO])","link":"http://arxiv.org/abs/2303.03548","description":"<p>Human models play a crucial role in human-robot interaction (HRI), enabling\nrobots to consider the impact of their actions on people and plan their\nbehavior accordingly. However, crafting good human models is challenging;\ncapturing context-dependent human behavior requires significant prior knowledge\nand/or large amounts of interaction data, both of which are difficult to\nobtain. In this work, we explore the potential of large-language models (LLMs)\n-- which have consumed vast amounts of human-generated text data -- to act as\nzero-shot human models for HRI. Our experiments on three social datasets yield\npromising results; the LLMs are able to achieve performance comparable to\npurpose-built models. That said, we also discuss current limitations, such as\nsensitivity to prompts and spatial/numerical reasoning mishaps. Based on our\nfindings, we demonstrate how LLM-based human models can be integrated into a\nsocial robot's planning process and applied in HRI scenarios. Specifically, we\npresent one case study on a simulated trust-based table-clearing task and\nreplicate past results that relied on custom models. Next, we conduct a new\nrobot utensil-passing experiment (n = 65) where preliminary results show that\nplanning with a LLM-based human model can achieve gains over a basic myopic\nplan. In summary, our results show that LLMs offer a promising (but incomplete)\napproach to human modeling for HRI.\n</p>","author":null,"categories":[],"comments":null,"enclosure":null,"guid":null,"pub_date":null,"source":null,"content":null,"extensions":{},"itunes_ext":null,"dublin_core_ext":{"contributors":[],"coverages":[],"creators":["<a href=\"http://arxiv.org/find/cs/1/au:+Zhang_B/0/1/0/all/0/1\">Bowen Zhang</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Soh_H/0/1/0/all/0/1\">Harold Soh</a>"],"dates":[],"descriptions":[],"formats":[],"identifiers":[],"languages":[],"publishers":[],"relations":[],"rights":[],"sources":[],"subjects":[],"titles":[],"types":[]}},{"title":"ADELT: Transpilation Between Deep Learning Frameworks. (arXiv:2303.03593v1 [cs.CL])","link":"http://arxiv.org/abs/2303.03593","description":"<p>We propose Adversarial DEep Learning Transpiler (ADELT) for source-to-source\ntranspilation between deep learning frameworks. Unlike prior approaches, we\ndecouple the transpilation of code skeletons and the mapping of API keywords\n(an API function name or a parameter name). ADELT transpile code skeletons\nusing few-shot prompting on big language models. Based on contextual embeddings\nextracted by a BERT for code, we train aligned API embeddings in a\ndomain-adversarial setup, upon which we generate a dictionary for keyword\ntranslation. The model is trained on our unlabeled DL corpus from web crawl\ndata, without using any hand-crafted rules and parallel data. Our method\noutperforms state-of-the-art transpilers on multiple transpilation pairs\nincluding PyTorch-Keras and PyTorch-MXNet by 15.9pts and 12.0pts in exact match\nscores respectively.\n</p>","author":null,"categories":[],"comments":null,"enclosure":null,"guid":null,"pub_date":null,"source":null,"content":null,"extensions":{},"itunes_ext":null,"dublin_core_ext":{"contributors":[],"coverages":[],"creators":["<a href=\"http://arxiv.org/find/cs/1/au:+Gong_L/0/1/0/all/0/1\">Linyuan Gong</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Wang_J/0/1/0/all/0/1\">Jiayi Wang</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Cheung_A/0/1/0/all/0/1\">Alvin Cheung</a>"],"dates":[],"descriptions":[],"formats":[],"identifiers":[],"languages":[],"publishers":[],"relations":[],"rights":[],"sources":[],"subjects":[],"titles":[],"types":[]}},{"title":"Adaptive Knowledge Distillation between Text and Speech Pre-trained Models. (arXiv:2303.03600v1 [cs.CL])","link":"http://arxiv.org/abs/2303.03600","description":"<p>Learning on a massive amount of speech corpus leads to the recent success of\nmany self-supervised speech models. With knowledge distillation, these models\nmay also benefit from the knowledge encoded by language models that are\npre-trained on rich sources of texts. The distillation process, however, is\nchallenging due to the modal disparity between textual and speech embedding\nspaces. This paper studies metric-based distillation to align the embedding\nspace of text and speech with only a small amount of data without modifying the\nmodel structure. Since the semantic and granularity gap between text and speech\nhas been omitted in literature, which impairs the distillation, we propose the\nPrior-informed Adaptive knowledge Distillation (PAD) that adaptively leverages\ntext/speech units of variable granularity and prior distributions to achieve\nbetter global and local alignments between text and speech pre-trained models.\nWe evaluate on three spoken language understanding benchmarks to show that PAD\nis more effective in transferring linguistic knowledge than other metric-based\ndistillation approaches.\n</p>","author":null,"categories":[],"comments":null,"enclosure":null,"guid":null,"pub_date":null,"source":null,"content":null,"extensions":{},"itunes_ext":null,"dublin_core_ext":{"contributors":[],"coverages":[],"creators":["<a href=\"http://arxiv.org/find/cs/1/au:+Ni_J/0/1/0/all/0/1\">Jinjie Ni</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Ma_Y/0/1/0/all/0/1\">Yukun Ma</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Wang_W/0/1/0/all/0/1\">Wen Wang</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Chen_Q/0/1/0/all/0/1\">Qian Chen</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Ng_D/0/1/0/all/0/1\">Dianwen Ng</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Lei_H/0/1/0/all/0/1\">Han Lei</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Nguyen_T/0/1/0/all/0/1\">Trung Hieu Nguyen</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Zhang_C/0/1/0/all/0/1\">Chong Zhang</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Ma_B/0/1/0/all/0/1\">Bin Ma</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Cambria_E/0/1/0/all/0/1\">Erik Cambria</a>"],"dates":[],"descriptions":[],"formats":[],"identifiers":[],"languages":[],"publishers":[],"relations":[],"rights":[],"sources":[],"subjects":[],"titles":[],"types":[]}},{"title":"Towards Interpretable and Efficient Automatic Reference-Based Summarization Evaluation. (arXiv:2303.03608v1 [cs.CL])","link":"http://arxiv.org/abs/2303.03608","description":"<p>Interpretability and efficiency are two important considerations for the\nadoption of neural automatic metrics. In this work, we develop\nstrong-performing automatic metrics for reference-based summarization\nevaluation, based on a two-stage evaluation pipeline that first extracts basic\ninformation units from one text sequence and then checks the extracted units in\nanother sequence. The metrics we developed include two-stage metrics that can\nprovide high interpretability at both the fine-grained unit level and summary\nlevel, and one-stage metrics that achieve a balance between efficiency and\ninteroperability. We make the developed tools publicly available through a\nPython package and GitHub.\n</p>","author":null,"categories":[],"comments":null,"enclosure":null,"guid":null,"pub_date":null,"source":null,"content":null,"extensions":{},"itunes_ext":null,"dublin_core_ext":{"contributors":[],"coverages":[],"creators":["<a href=\"http://arxiv.org/find/cs/1/au:+Liu_Y/0/1/0/all/0/1\">Yixin Liu</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Fabbri_A/0/1/0/all/0/1\">Alexander R. Fabbri</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Zhao_Y/0/1/0/all/0/1\">Yilun Zhao</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Liu_P/0/1/0/all/0/1\">Pengfei Liu</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Joty_S/0/1/0/all/0/1\">Shafiq Joty</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Wu_C/0/1/0/all/0/1\">Chien-Sheng Wu</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Xiong_C/0/1/0/all/0/1\">Caiming Xiong</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Radev_D/0/1/0/all/0/1\">Dragomir Radev</a>"],"dates":[],"descriptions":[],"formats":[],"identifiers":[],"languages":[],"publishers":[],"relations":[],"rights":[],"sources":[],"subjects":[],"titles":[],"types":[]}},{"title":"CoTEVer: Chain of Thought Prompting Annotation Toolkit for Explanation Verification. (arXiv:2303.03628v1 [cs.CL])","link":"http://arxiv.org/abs/2303.03628","description":"<p>Chain-of-thought (CoT) prompting enables large language models (LLMs) to\nsolve complex reasoning tasks by generating an explanation before the final\nprediction. Despite it's promising ability, a critical downside of CoT\nprompting is that the performance is greatly affected by the factuality of the\ngenerated explanation. To improve the correctness of the explanations,\nfine-tuning language models with explanation data is needed. However, there\nexists only a few datasets that can be used for such approaches, and no data\ncollection tool for building them. Thus, we introduce CoTEVer, a tool-kit for\nannotating the factual correctness of generated explanations and collecting\nrevision data of wrong explanations. Furthermore, we suggest several use cases\nwhere the data collected with CoTEVer can be utilized for enhancing the\nfaithfulness of explanations. Our toolkit is publicly available at\nhttps://github.com/SeungoneKim/CoTEVer.\n</p>","author":null,"categories":[],"comments":null,"enclosure":null,"guid":null,"pub_date":null,"source":null,"content":null,"extensions":{},"itunes_ext":null,"dublin_core_ext":{"contributors":[],"coverages":[],"creators":["<a href=\"http://arxiv.org/find/cs/1/au:+Kim_S/0/1/0/all/0/1\">Seungone Kim</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Joo_S/0/1/0/all/0/1\">Se June Joo</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Jang_Y/0/1/0/all/0/1\">Yul Jang</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Chae_H/0/1/0/all/0/1\">Hyungjoo Chae</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Yeo_J/0/1/0/all/0/1\">Jinyoung Yeo</a>"],"dates":[],"descriptions":[],"formats":[],"identifiers":[],"languages":[],"publishers":[],"relations":[],"rights":[],"sources":[],"subjects":[],"titles":[],"types":[]}},{"title":"Stylometric Detection of AI-Generated Text in Twitter Timelines. (arXiv:2303.03697v1 [cs.CL])","link":"http://arxiv.org/abs/2303.03697","description":"<p>Recent advancements in pre-trained language models have enabled convenient\nmethods for generating human-like text at a large scale. Though these\ngeneration capabilities hold great potential for breakthrough applications, it\ncan also be a tool for an adversary to generate misinformation. In particular,\nsocial media platforms like Twitter are highly susceptible to AI-generated\nmisinformation. A potential threat scenario is when an adversary hijacks a\ncredible user account and incorporates a natural language generator to generate\nmisinformation. Such threats necessitate automated detectors for AI-generated\ntweets in a given user's Twitter timeline. However, tweets are inherently\nshort, thus making it difficult for current state-of-the-art pre-trained\nlanguage model-based detectors to accurately detect at what point the AI starts\nto generate tweets in a given Twitter timeline. In this paper, we present a\nnovel algorithm using stylometric signals to aid detecting AI-generated tweets.\nWe propose models corresponding to quantifying stylistic changes in human and\nAI tweets in two related tasks: Task 1 - discriminate between human and\nAI-generated tweets, and Task 2 - detect if and when an AI starts to generate\ntweets in a given Twitter timeline. Our extensive experiments demonstrate that\nthe stylometric features are effective in augmenting the state-of-the-art\nAI-generated text detectors.\n</p>","author":null,"categories":[],"comments":null,"enclosure":null,"guid":null,"pub_date":null,"source":null,"content":null,"extensions":{},"itunes_ext":null,"dublin_core_ext":{"contributors":[],"coverages":[],"creators":["<a href=\"http://arxiv.org/find/cs/1/au:+Kumarage_T/0/1/0/all/0/1\">Tharindu Kumarage</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Garland_J/0/1/0/all/0/1\">Joshua Garland</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Bhattacharjee_A/0/1/0/all/0/1\">Amrita Bhattacharjee</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Trapeznikov_K/0/1/0/all/0/1\">Kirill Trapeznikov</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Ruston_S/0/1/0/all/0/1\">Scott Ruston</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Liu_H/0/1/0/all/0/1\">Huan Liu</a>"],"dates":[],"descriptions":[],"formats":[],"identifiers":[],"languages":[],"publishers":[],"relations":[],"rights":[],"sources":[],"subjects":[],"titles":[],"types":[]}},{"title":"Classifying Text-Based Conspiracy Tweets related to COVID-19 using Contextualized Word Embeddings. (arXiv:2303.03706v1 [cs.CL])","link":"http://arxiv.org/abs/2303.03706","description":"<p>The FakeNews task in MediaEval 2022 investigates the challenge of finding\naccurate and high-performance models for the classification of conspiracy\ntweets related to COVID-19. In this paper, we used BERT, ELMO, and their\ncombination for feature extraction and RandomForest as classifier. The results\nshow that ELMO performs slightly better than BERT, however their combination at\nfeature level reduces the performance.\n</p>","author":null,"categories":[],"comments":null,"enclosure":null,"guid":null,"pub_date":null,"source":null,"content":null,"extensions":{},"itunes_ext":null,"dublin_core_ext":{"contributors":[],"coverages":[],"creators":["<a href=\"http://arxiv.org/find/cs/1/au:+Rehman_A/0/1/0/all/0/1\">Abdul Rehman</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Abbasi_R/0/1/0/all/0/1\">Rabeeh Ayaz Abbasi</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Qureshi_I/0/1/0/all/0/1\">Irfan ul Haq Qureshi</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Khattak_A/0/1/0/all/0/1\">Akmal Saeed Khattak</a>"],"dates":[],"descriptions":[],"formats":[],"identifiers":[],"languages":[],"publishers":[],"relations":[],"rights":[],"sources":[],"subjects":[],"titles":[],"types":[]}},{"title":"Universal resources for quantum computing. (arXiv:2303.03715v1 [quant-ph])","link":"http://arxiv.org/abs/2303.03715","description":"<p>Unravelling the source of quantum computing power has been a major goal in\nthe field of quantum information science. In recent years, the quantum resource\ntheory (QRT) has been established to characterize various quantum resources,\nyet their roles in quantum computing tasks still require investigation. The\nso-called universal quantum computing model (UQCM), e.g., the circuit model,\nhas been the main framework to guide the design of quantum algorithms, creation\nof real quantum computers etc. In this work, we combine the study of UQCM\ntogether with QRT. We find on one hand, using QRT can provide a\nresource-theoretic characterization of a UQCM, the relation among models and\ninspire new ones, and on the other hand, using UQCM offers a framework to apply\nresources, study relation among resources and classify them.\n</p>\n<p>We develop the theory of universal resources in the setting of UQCM, and find\na rich spectrum of UQCMs and the corresponding universal resources. Depending\non a hierarchical structure of resource theories, we find models can be\nclassified into families. In this work, we study three natural families of\nUQCMs in details: the amplitude family, the quasi-probability family, and the\nHamiltonian family. They include some well known models, like the\nmeasurement-based model and adiabatic model, and also inspire new models such\nas the contextual model we introduce. Each family contains at least a triplet\nof models, and such a succinct structure of families of UQCMs offers a unifying\npicture to investigate resources and design models. It also provides a rigorous\nframework to resolve puzzles, such as the role of entanglement vs.\ninterference, and unravel resource-theoretic features of quantum algorithms.\n</p>","author":null,"categories":[],"comments":null,"enclosure":null,"guid":null,"pub_date":null,"source":null,"content":null,"extensions":{},"itunes_ext":null,"dublin_core_ext":{"contributors":[],"coverages":[],"creators":["<a href=\"http://arxiv.org/find/quant-ph/1/au:+Wang_D/0/1/0/all/0/1\">Dong-Sheng Wang</a>"],"dates":[],"descriptions":[],"formats":[],"identifiers":[],"languages":[],"publishers":[],"relations":[],"rights":[],"sources":[],"subjects":[],"titles":[],"types":[]}},{"title":"Preparing the Vuk'uzenzele and ZA-gov-multilingual South African multilingual corpora. (arXiv:2303.03750v1 [cs.CL])","link":"http://arxiv.org/abs/2303.03750","description":"<p>This paper introduces two multilingual government themed corpora in various\nSouth African languages. The corpora were collected by gathering the South\nAfrican Government newspaper (Vuk'uzenzele), as well as South African\ngovernment speeches (ZA-gov-multilingual), that are translated into all 11\nSouth African official languages. The corpora can be used for a myriad of\ndownstream NLP tasks. The corpora were created to allow researchers to study\nthe language used in South African government publications, with a focus on\nunderstanding how South African government officials communicate with their\nconstituents.\n</p>\n<p>In this paper we highlight the process of gathering, cleaning and making\navailable the corpora. We create parallel sentence corpora for Neural Machine\nTranslation (NMT) tasks using Language-Agnostic Sentence Representations\n(LASER) embeddings. With these aligned sentences we then provide NMT benchmarks\nfor 9 indigenous languages by fine-tuning a massively multilingual pre-trained\nlanguage model. \\end{abstra\n</p>","author":null,"categories":[],"comments":null,"enclosure":null,"guid":null,"pub_date":null,"source":null,"content":null,"extensions":{},"itunes_ext":null,"dublin_core_ext":{"contributors":[],"coverages":[],"creators":["<a href=\"http://arxiv.org/find/cs/1/au:+Lastrucci_R/0/1/0/all/0/1\">Richard Lastrucci</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Dzingirai_I/0/1/0/all/0/1\">Isheanesu Dzingirai</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Rajab_J/0/1/0/all/0/1\">Jenalea Rajab</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Madodonga_A/0/1/0/all/0/1\">Andani Madodonga</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Shingange_M/0/1/0/all/0/1\">Matimba Shingange</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Njini_D/0/1/0/all/0/1\">Daniel Njini</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Marivate_V/0/1/0/all/0/1\">Vukosi Marivate</a>"],"dates":[],"descriptions":[],"formats":[],"identifiers":[],"languages":[],"publishers":[],"relations":[],"rights":[],"sources":[],"subjects":[],"titles":[],"types":[]}},{"title":"Exploring the Feasibility of ChatGPT for Event Extraction. (arXiv:2303.03836v1 [cs.CL])","link":"http://arxiv.org/abs/2303.03836","description":"<p>Event extraction is a fundamental task in natural language processing that\ninvolves identifying and extracting information about events mentioned in text.\nHowever, it is a challenging task due to the lack of annotated data, which is\nexpensive and time-consuming to obtain. The emergence of large language models\n(LLMs) such as ChatGPT provides an opportunity to solve language tasks with\nsimple prompts without the need for task-specific datasets and fine-tuning.\nWhile ChatGPT has demonstrated impressive results in tasks like machine\ntranslation, text summarization, and question answering, it presents challenges\nwhen used for complex tasks like event extraction. Unlike other tasks, event\nextraction requires the model to be provided with a complex set of instructions\ndefining all event types and their schemas. To explore the feasibility of\nChatGPT for event extraction and the challenges it poses, we conducted a series\nof experiments. Our results show that ChatGPT has, on average, only 51.04% of\nthe performance of a task-specific model such as EEQA in long-tail and complex\nscenarios. Our usability testing experiments indicate that ChatGPT is not\nrobust enough, and continuous refinement of the prompt does not lead to stable\nperformance improvements, which can result in a poor user experience. Besides,\nChatGPT is highly sensitive to different prompt styles.\n</p>","author":null,"categories":[],"comments":null,"enclosure":null,"guid":null,"pub_date":null,"source":null,"content":null,"extensions":{},"itunes_ext":null,"dublin_core_ext":{"contributors":[],"coverages":[],"creators":["<a href=\"http://arxiv.org/find/cs/1/au:+Gao_J/0/1/0/all/0/1\">Jun Gao</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Zhao_H/0/1/0/all/0/1\">Huan Zhao</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Yu_C/0/1/0/all/0/1\">Changlong Yu</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Xu_R/0/1/0/all/0/1\">Ruifeng Xu</a>"],"dates":[],"descriptions":[],"formats":[],"identifiers":[],"languages":[],"publishers":[],"relations":[],"rights":[],"sources":[],"subjects":[],"titles":[],"types":[]}},{"title":"A Challenging Benchmark for Low-Resource Learning. (arXiv:2303.03840v1 [cs.CL])","link":"http://arxiv.org/abs/2303.03840","description":"<p>With promising yet saturated results in high-resource settings, low-resource\ndatasets have gradually become popular benchmarks for evaluating the learning\nability of advanced neural networks (e.g., BigBench, superGLUE). Some models\neven surpass humans according to benchmark test results. However, we find that\nthere exists a set of hard examples in low-resource settings that challenge\nneural networks but are not well evaluated, which causes over-estimated\nperformance. We first give a theoretical analysis on which factors bring the\ndifficulty of low-resource learning. It then motivate us to propose a\nchallenging benchmark hardBench to better evaluate the learning ability, which\ncovers 11 datasets, including 3 computer vision (CV) datasets and 8 natural\nlanguage process (NLP) datasets. Experiments on a wide range of models show\nthat neural networks, even pre-trained language models, have sharp performance\ndrops on our benchmark, demonstrating the effectiveness on evaluating the\nweaknesses of neural networks. On NLP tasks, we surprisingly find that despite\nbetter results on traditional low-resource benchmarks, pre-trained networks,\ndoes not show performance improvements on our benchmarks. These results\ndemonstrate that there are still a large robustness gap between existing models\nand human-level performance.\n</p>","author":null,"categories":[],"comments":null,"enclosure":null,"guid":null,"pub_date":null,"source":null,"content":null,"extensions":{},"itunes_ext":null,"dublin_core_ext":{"contributors":[],"coverages":[],"creators":["<a href=\"http://arxiv.org/find/cs/1/au:+Wang_Y/0/1/0/all/0/1\">Yudong Wang</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Ma_C/0/1/0/all/0/1\">Chang Ma</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Dong_Q/0/1/0/all/0/1\">Qingxiu Dong</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Kong_L/0/1/0/all/0/1\">Lingpeng Kong</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Xu_J/0/1/0/all/0/1\">Jingjing Xu</a>"],"dates":[],"descriptions":[],"formats":[],"identifiers":[],"languages":[],"publishers":[],"relations":[],"rights":[],"sources":[],"subjects":[],"titles":[],"types":[]}},{"title":"Larger language models do in-context learning differently. (arXiv:2303.03846v1 [cs.CL])","link":"http://arxiv.org/abs/2303.03846","description":"<p>We study how in-context learning (ICL) in language models is affected by\nsemantic priors versus input-label mappings. We investigate two setups-ICL with\nflipped labels and ICL with semantically-unrelated labels-across various model\nfamilies (GPT-3, InstructGPT, Codex, PaLM, and Flan-PaLM). First, experiments\non ICL with flipped labels show that overriding semantic priors is an emergent\nability of model scale. While small language models ignore flipped labels\npresented in-context and thus rely primarily on semantic priors from\npretraining, large models can override semantic priors when presented with\nin-context exemplars that contradict priors, despite the stronger semantic\npriors that larger models may hold. We next study semantically-unrelated label\nICL (SUL-ICL), in which labels are semantically unrelated to their inputs\n(e.g., foo/bar instead of negative/positive), thereby forcing language models\nto learn the input-label mappings shown in in-context exemplars in order to\nperform the task. The ability to do SUL-ICL also emerges primarily with scale,\nand large-enough language models can even perform linear classification in a\nSUL-ICL setting. Finally, we evaluate instruction-tuned models and find that\ninstruction tuning strengthens both the use of semantic priors and the capacity\nto learn input-label mappings, but more of the former.\n</p>","author":null,"categories":[],"comments":null,"enclosure":null,"guid":null,"pub_date":null,"source":null,"content":null,"extensions":{},"itunes_ext":null,"dublin_core_ext":{"contributors":[],"coverages":[],"creators":["<a href=\"http://arxiv.org/find/cs/1/au:+Wei_J/0/1/0/all/0/1\">Jerry Wei</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Wei_J/0/1/0/all/0/1\">Jason Wei</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Tay_Y/0/1/0/all/0/1\">Yi Tay</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Tran_D/0/1/0/all/0/1\">Dustin Tran</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Webson_A/0/1/0/all/0/1\">Albert Webson</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Lu_Y/0/1/0/all/0/1\">Yifeng Lu</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Chen_X/0/1/0/all/0/1\">Xinyun Chen</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Liu_H/0/1/0/all/0/1\">Hanxiao Liu</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Huang_D/0/1/0/all/0/1\">Da Huang</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Zhou_D/0/1/0/all/0/1\">Denny Zhou</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Ma_T/0/1/0/all/0/1\">Tengyu Ma</a>"],"dates":[],"descriptions":[],"formats":[],"identifiers":[],"languages":[],"publishers":[],"relations":[],"rights":[],"sources":[],"subjects":[],"titles":[],"types":[]}},{"title":"Document-level Relation Extraction with Cross-sentence Reasoning Graph. (arXiv:2303.03912v1 [cs.CL])","link":"http://arxiv.org/abs/2303.03912","description":"<p>Relation extraction (RE) has recently moved from the sentence-level to\ndocument-level, which requires aggregating document information and using\nentities and mentions for reasoning. Existing works put entity nodes and\nmention nodes with similar representations in a document-level graph, whose\ncomplex edges may incur redundant information. Furthermore, existing studies\nonly focus on entity-level reasoning paths without considering global\ninteractions among entities cross-sentence. To these ends, we propose a novel\ndocument-level RE model with a GRaph information Aggregation and Cross-sentence\nReasoning network (GRACR). Specifically, a simplified document-level graph is\nconstructed to model the semantic information of all mentions and sentences in\na document, and an entity-level graph is designed to explore relations of\nlong-distance cross-sentence entity pairs. Experimental results show that GRACR\nachieves excellent performance on two public datasets of document-level RE. It\nis especially effective in extracting potential relations of cross-sentence\nentity pairs. Our code is available at https://github.com/UESTC-LHF/GRACR.\n</p>","author":null,"categories":[],"comments":null,"enclosure":null,"guid":null,"pub_date":null,"source":null,"content":null,"extensions":{},"itunes_ext":null,"dublin_core_ext":{"contributors":[],"coverages":[],"creators":["<a href=\"http://arxiv.org/find/cs/1/au:+Liu_H/0/1/0/all/0/1\">Hongfei Liu</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Kang_Z/0/1/0/all/0/1\">Zhao Kang</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Zhang_L/0/1/0/all/0/1\">Lizong Zhang</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Tian_L/0/1/0/all/0/1\">Ling Tian</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Hua_F/0/1/0/all/0/1\">Fujun Hua</a>"],"dates":[],"descriptions":[],"formats":[],"identifiers":[],"languages":[],"publishers":[],"relations":[],"rights":[],"sources":[],"subjects":[],"titles":[],"types":[]}},{"title":"The BigScience ROOTS Corpus: A 1.6TB Composite Multilingual Dataset. (arXiv:2303.03915v1 [cs.CL])","link":"http://arxiv.org/abs/2303.03915","description":"<p>As language models grow ever larger, the need for large-scale high-quality\ntext datasets has never been more pressing, especially in multilingual\nsettings. The BigScience workshop, a 1-year international and multidisciplinary\ninitiative, was formed with the goal of researching and training large language\nmodels as a values-driven undertaking, putting issues of ethics, harm, and\ngovernance in the foreground. This paper documents the data creation and\ncuration efforts undertaken by BigScience to assemble the Responsible\nOpen-science Open-collaboration Text Sources (ROOTS) corpus, a 1.6TB dataset\nspanning 59 languages that was used to train the 176-billion-parameter\nBigScience Large Open-science Open-access Multilingual (BLOOM) language model.\nWe further release a large initial subset of the corpus and analyses thereof,\nand hope to empower large-scale monolingual and multilingual modeling projects\nwith both the data and the processing tools, as well as stimulate research\naround this large multilingual corpus.\n</p>","author":null,"categories":[],"comments":null,"enclosure":null,"guid":null,"pub_date":null,"source":null,"content":null,"extensions":{},"itunes_ext":null,"dublin_core_ext":{"contributors":[],"coverages":[],"creators":["<a href=\"http://arxiv.org/find/cs/1/au:+Laurencon_H/0/1/0/all/0/1\">Hugo Lauren&#xe7;on</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Saulnier_L/0/1/0/all/0/1\">Lucile Saulnier</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Wang_T/0/1/0/all/0/1\">Thomas Wang</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Akiki_C/0/1/0/all/0/1\">Christopher Akiki</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Moral_A/0/1/0/all/0/1\">Albert Villanova del Moral</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Scao_T/0/1/0/all/0/1\">Teven Le Scao</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Werra_L/0/1/0/all/0/1\">Leandro Von Werra</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Mou_C/0/1/0/all/0/1\">Chenghao Mou</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Ponferrada_E/0/1/0/all/0/1\">Eduardo Gonz&#xe1;lez Ponferrada</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Nguyen_H/0/1/0/all/0/1\">Huu Nguyen</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Frohberg_J/0/1/0/all/0/1\">J&#xf6;rg Frohberg</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Sasko_M/0/1/0/all/0/1\">Mario &#x160;a&#x161;ko</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Lhoest_Q/0/1/0/all/0/1\">Quentin Lhoest</a>, <a href=\"http://arxiv.org/find/cs/1/au:+McMillan_Major_A/0/1/0/all/0/1\">Angelina McMillan-Major</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Dupont_G/0/1/0/all/0/1\">Gerard Dupont</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Biderman_S/0/1/0/all/0/1\">Stella Biderman</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Rogers_A/0/1/0/all/0/1\">Anna Rogers</a>, <a href=\"http://arxiv.org/find/cs/1/au:+allal_L/0/1/0/all/0/1\">Loubna Ben allal</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Toni_F/0/1/0/all/0/1\">Francesco De Toni</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Pistilli_G/0/1/0/all/0/1\">Giada Pistilli</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Nguyen_O/0/1/0/all/0/1\">Olivier Nguyen</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Nikpoor_S/0/1/0/all/0/1\">Somaieh Nikpoor</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Masoud_M/0/1/0/all/0/1\">Maraim Masoud</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Colombo_P/0/1/0/all/0/1\">Pierre Colombo</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Rosa_J/0/1/0/all/0/1\">Javier de la Rosa</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Villegas_P/0/1/0/all/0/1\">Paulo Villegas</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Thrush_T/0/1/0/all/0/1\">Tristan Thrush</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Longpre_S/0/1/0/all/0/1\">Shayne Longpre</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Nagel_S/0/1/0/all/0/1\">Sebastian Nagel</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Weber_L/0/1/0/all/0/1\">Leon Weber</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Munoz_M/0/1/0/all/0/1\">Manuel Mu&#xf1;oz</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Zhu_J/0/1/0/all/0/1\">Jian Zhu</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Strien_D/0/1/0/all/0/1\">Daniel Van Strien</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Alyafeai_Z/0/1/0/all/0/1\">Zaid Alyafeai</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Almubarak_K/0/1/0/all/0/1\">Khalid Almubarak</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Vu_M/0/1/0/all/0/1\">Minh Chien Vu</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Gonzalez_Dios_I/0/1/0/all/0/1\">Itziar Gonzalez-Dios</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Soroa_A/0/1/0/all/0/1\">Aitor Soroa</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Lo_K/0/1/0/all/0/1\">Kyle Lo</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Dey_M/0/1/0/all/0/1\">Manan Dey</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Suarez_P/0/1/0/all/0/1\">Pedro Ortiz Suarez</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Gokaslan_A/0/1/0/all/0/1\">Aaron Gokaslan</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Bose_S/0/1/0/all/0/1\">Shamik Bose</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Adelani_D/0/1/0/all/0/1\">David Adelani</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Phan_L/0/1/0/all/0/1\">Long Phan</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Tran_H/0/1/0/all/0/1\">Hieu Tran</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Yu_I/0/1/0/all/0/1\">Ian Yu</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Pai_S/0/1/0/all/0/1\">Suhas Pai</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Chim_J/0/1/0/all/0/1\">Jenny Chim</a>, et al. (5 additional authors not shown)"],"dates":[],"descriptions":[],"formats":[],"identifiers":[],"languages":[],"publishers":[],"relations":[],"rights":[],"sources":[],"subjects":[],"titles":[],"types":[]}},{"title":"Data Portraits: Recording Foundation Model Training Data. (arXiv:2303.03919v1 [cs.LG])","link":"http://arxiv.org/abs/2303.03919","description":"<p>Foundation models are trained on increasingly immense and opaque datasets.\nEven while these models are now key in AI system building, it can be difficult\nto answer the straightforward question: has the model already encountered a\ngiven example during training? We therefore propose a widespread adoption of\nData Portraits: artifacts that record training data and allow for downstream\ninspection. First we outline the properties of such an artifact and discuss how\nexisting solutions can be used to increase transparency. We then propose and\nimplement a solution based on data sketching, stressing fast and space\nefficient querying. Using our tool, we document a popular large language\nmodeling corpus (the Pile) and show that our solution enables answering\nquestions about test set leakage and model plagiarism. Our tool is lightweight\nand fast, costing only 3% of the dataset size in overhead. We release a demo of\nour tools at dataportraits.org and call on dataset and model creators to\nrelease Data Portraits as a complement to current documentation practices.\n</p>","author":null,"categories":[],"comments":null,"enclosure":null,"guid":null,"pub_date":null,"source":null,"content":null,"extensions":{},"itunes_ext":null,"dublin_core_ext":{"contributors":[],"coverages":[],"creators":["<a href=\"http://arxiv.org/find/cs/1/au:+Marone_M/0/1/0/all/0/1\">Marc Marone</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Durme_B/0/1/0/all/0/1\">Benjamin Van Durme</a>"],"dates":[],"descriptions":[],"formats":[],"identifiers":[],"languages":[],"publishers":[],"relations":[],"rights":[],"sources":[],"subjects":[],"titles":[],"types":[]}},{"title":"Structure Pretraining and Prompt Tuning for Knowledge Graph Transfer. (arXiv:2303.03922v1 [cs.LG])","link":"http://arxiv.org/abs/2303.03922","description":"<p>Knowledge graphs (KG) are essential background knowledge providers in many\ntasks. When designing models for KG-related tasks, one of the key tasks is to\ndevise the Knowledge Representation and Fusion (KRF) module that learns the\nrepresentation of elements from KGs and fuses them with task representations.\nWhile due to the difference of KGs and perspectives to be considered during\nfusion across tasks, duplicate and ad hoc KRF modules design are conducted\namong tasks. In this paper, we propose a novel knowledge graph pretraining\nmodel KGTransformer that could serve as a uniform KRF module in diverse\nKG-related tasks. We pretrain KGTransformer with three self-supervised tasks\nwith sampled sub-graphs as input. For utilization, we propose a general\nprompt-tuning mechanism regarding task data as a triple prompt to allow\nflexible interactions between task KGs and task data. We evaluate pretrained\nKGTransformer on three tasks, triple classification, zero-shot image\nclassification, and question answering. KGTransformer consistently achieves\nbetter results than specifically designed task models. Through experiments, we\njustify that the pretrained KGTransformer could be used off the shelf as a\ngeneral and effective KRF module across KG-related tasks. The code and datasets\nare available at https://github.com/zjukg/KGTransformer.\n</p>","author":null,"categories":[],"comments":null,"enclosure":null,"guid":null,"pub_date":null,"source":null,"content":null,"extensions":{},"itunes_ext":null,"dublin_core_ext":{"contributors":[],"coverages":[],"creators":["<a href=\"http://arxiv.org/find/cs/1/au:+Zhang_W/0/1/0/all/0/1\">Wen Zhang</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Zhu_Y/0/1/0/all/0/1\">Yushan Zhu</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Chen_M/0/1/0/all/0/1\">Mingyang Chen</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Geng_Y/0/1/0/all/0/1\">Yuxia Geng</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Huang_Y/0/1/0/all/0/1\">Yufeng Huang</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Xu_Y/0/1/0/all/0/1\">Yajing Xu</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Song_W/0/1/0/all/0/1\">Wenting Song</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Chen_H/0/1/0/all/0/1\">Huajun Chen</a>"],"dates":[],"descriptions":[],"formats":[],"identifiers":[],"languages":[],"publishers":[],"relations":[],"rights":[],"sources":[],"subjects":[],"titles":[],"types":[]}},{"title":"Speak Foreign Languages with Your Own Voice: Cross-Lingual Neural Codec Language Modeling. (arXiv:2303.03926v1 [cs.CL])","link":"http://arxiv.org/abs/2303.03926","description":"<p>We propose a cross-lingual neural codec language model, VALL-E X, for\ncross-lingual speech synthesis. Specifically, we extend VALL-E and train a\nmulti-lingual conditional codec language model to predict the acoustic token\nsequences of the target language speech by using both the source language\nspeech and the target language text as prompts. VALL-E X inherits strong\nin-context learning capabilities and can be applied for zero-shot cross-lingual\ntext-to-speech synthesis and zero-shot speech-to-speech translation tasks.\nExperimental results show that it can generate high-quality speech in the\ntarget language via just one speech utterance in the source language as a\nprompt while preserving the unseen speaker's voice, emotion, and acoustic\nenvironment. Moreover, VALL-E X effectively alleviates the foreign accent\nproblems, which can be controlled by a language ID. Audio samples are available\nat \\url{https://aka.ms/vallex}.\n</p>","author":null,"categories":[],"comments":null,"enclosure":null,"guid":null,"pub_date":null,"source":null,"content":null,"extensions":{},"itunes_ext":null,"dublin_core_ext":{"contributors":[],"coverages":[],"creators":["<a href=\"http://arxiv.org/find/cs/1/au:+Zhang_Z/0/1/0/all/0/1\">Ziqiang Zhang</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Zhou_L/0/1/0/all/0/1\">Long Zhou</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Wang_C/0/1/0/all/0/1\">Chengyi Wang</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Chen_S/0/1/0/all/0/1\">Sanyuan Chen</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Wu_Y/0/1/0/all/0/1\">Yu Wu</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Liu_S/0/1/0/all/0/1\">Shujie Liu</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Chen_Z/0/1/0/all/0/1\">Zhuo Chen</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Liu_Y/0/1/0/all/0/1\">Yanqing Liu</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Wang_H/0/1/0/all/0/1\">Huaming Wang</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Li_J/0/1/0/all/0/1\">Jinyu Li</a>, <a href=\"http://arxiv.org/find/cs/1/au:+He_L/0/1/0/all/0/1\">Lei He</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Zhao_S/0/1/0/all/0/1\">Sheng Zhao</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Wei_F/0/1/0/all/0/1\">Furu Wei</a>"],"dates":[],"descriptions":[],"formats":[],"identifiers":[],"languages":[],"publishers":[],"relations":[],"rights":[],"sources":[],"subjects":[],"titles":[],"types":[]}},{"title":"A Meta-Evaluation of Faithfulness Metrics for Long-Form Hospital-Course Summarization. (arXiv:2303.03948v1 [cs.CL])","link":"http://arxiv.org/abs/2303.03948","description":"<p>Long-form clinical summarization of hospital admissions has real-world\nsignificance because of its potential to help both clinicians and patients. The\nfaithfulness of summaries is critical to their safe usage in clinical settings.\nTo better understand the limitations of abstractive systems, as well as the\nsuitability of existing evaluation metrics, we benchmark faithfulness metrics\nagainst fine-grained human annotations for model-generated summaries of a\npatient's Brief Hospital Course. We create a corpus of patient hospital\nadmissions and summaries for a cohort of HIV patients, each with complex\nmedical histories. Annotators are presented with summaries and source notes,\nand asked to categorize manually highlighted summary elements (clinical\nentities like conditions and medications as well as actions like \"following\nup\") into one of three categories: ``Incorrect,'' ``Missing,'' and ``Not in\nNotes.'' We meta-evaluate a broad set of proposed faithfulness metrics and,\nacross metrics, explore the importance of domain adaptation (e.g. the impact of\nin-domain pre-training and metric fine-tuning), the use of source-summary\nalignments, and the effects of distilling a single metric from an ensemble of\npre-existing metrics. Off-the-shelf metrics with no exposure to clinical text\ncorrelate well yet overly rely on summary extractiveness. As a practical guide\nto long-form clinical narrative summarization, we find that most metrics\ncorrelate best to human judgments when provided with one summary sentence at a\ntime and a minimal set of relevant source context.\n</p>","author":null,"categories":[],"comments":null,"enclosure":null,"guid":null,"pub_date":null,"source":null,"content":null,"extensions":{},"itunes_ext":null,"dublin_core_ext":{"contributors":[],"coverages":[],"creators":["<a href=\"http://arxiv.org/find/cs/1/au:+Adams_G/0/1/0/all/0/1\">Griffin Adams</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Zucker_J/0/1/0/all/0/1\">Jason Zucker</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Elhadad_N/0/1/0/all/0/1\">No&#xe9;mie Elhadad</a>"],"dates":[],"descriptions":[],"formats":[],"identifiers":[],"languages":[],"publishers":[],"relations":[],"rights":[],"sources":[],"subjects":[],"titles":[],"types":[]}},{"title":"ChatGPT: Beginning of an End of Manual Annotation? Use Case of Automatic Genre Identification. (arXiv:2303.03953v1 [cs.CL])","link":"http://arxiv.org/abs/2303.03953","description":"<p>ChatGPT has shown strong capabilities in natural language generation tasks,\nwhich naturally leads researchers to explore where its abilities end. In this\npaper, we examine whether ChatGPT can be used for zero-shot text\nclassification, more specifically, automatic genre identification. We compare\nChatGPT with a multilingual XLM-RoBERTa language model that was fine-tuned on\ndatasets, manually annotated with genres. The models are compared on test sets\nin two languages: English and Slovenian. Results show that ChatGPT outperforms\nthe fine-tuned model when applied to the dataset which was not seen before by\neither of the models. Even when applied on Slovenian language as an\nunder-resourced language, ChatGPT's performance is no worse than when applied\nto English. However, if the model is fully prompted in Slovenian, the\nperformance drops significantly, showing the current limitations of ChatGPT\nusage on smaller languages. The presented results lead us to questioning\nwhether this is the beginning of an end of laborious manual annotation\ncampaigns even for smaller languages, such as Slovenian.\n</p>","author":null,"categories":[],"comments":null,"enclosure":null,"guid":null,"pub_date":null,"source":null,"content":null,"extensions":{},"itunes_ext":null,"dublin_core_ext":{"contributors":[],"coverages":[],"creators":["<a href=\"http://arxiv.org/find/cs/1/au:+Kuzman_T/0/1/0/all/0/1\">Taja Kuzman</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Ljubesic_N/0/1/0/all/0/1\">Nikola Ljube&#x161;i&#x107;</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Mozetic_I/0/1/0/all/0/1\">Igor Mozeti&#x10d;</a>"],"dates":[],"descriptions":[],"formats":[],"identifiers":[],"languages":[],"publishers":[],"relations":[],"rights":[],"sources":[],"subjects":[],"titles":[],"types":[]}},{"title":"GATE: A Challenge Set for Gender-Ambiguous Translation Examples. (arXiv:2303.03975v1 [cs.CL])","link":"http://arxiv.org/abs/2303.03975","description":"<p>Although recent years have brought significant progress in improving\ntranslation of unambiguously gendered sentences, translation of ambiguously\ngendered input remains relatively unexplored. When source gender is ambiguous,\nmachine translation models typically default to stereotypical gender roles,\nperpetuating harmful bias. Recent work has led to the development of \"gender\nrewriters\" that generate alternative gender translations on such ambiguous\ninputs, but such systems are plagued by poor linguistic coverage. To encourage\nbetter performance on this task we present and release GATE, a linguistically\ndiverse corpus of gender-ambiguous source sentences along with multiple\nalternative target language translations. We also provide tools for evaluation\nand system analysis when using GATE and use them to evaluate our translation\nrewriter system.\n</p>","author":null,"categories":[],"comments":null,"enclosure":null,"guid":null,"pub_date":null,"source":null,"content":null,"extensions":{},"itunes_ext":null,"dublin_core_ext":{"contributors":[],"coverages":[],"creators":["<a href=\"http://arxiv.org/find/cs/1/au:+Rarrick_S/0/1/0/all/0/1\">Spencer Rarrick</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Naik_R/0/1/0/all/0/1\">Ranjita Naik</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Mathur_V/0/1/0/all/0/1\">Varun Mathur</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Poudel_S/0/1/0/all/0/1\">Sundar Poudel</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Chowdhary_V/0/1/0/all/0/1\">Vishal Chowdhary</a>"],"dates":[],"descriptions":[],"formats":[],"identifiers":[],"languages":[],"publishers":[],"relations":[],"rights":[],"sources":[],"subjects":[],"titles":[],"types":[]}},{"title":"ELODIN: Naming Concepts in Embedding Spaces. (arXiv:2303.04001v1 [cs.CV])","link":"http://arxiv.org/abs/2303.04001","description":"<p>Despite recent advancements, the field of text-to-image synthesis still\nsuffers from lack of fine-grained control. Using only text, it remains\nchallenging to deal with issues such as concept coherence and concept\ncontamination. We propose a method to enhance control by generating specific\nconcepts that can be reused throughout multiple images, effectively expanding\nnatural language with new words that can be combined much like a painter's\npalette. Unlike previous contributions, our method does not copy visuals from\ninput data and can generate concepts through text alone. We perform a set of\ncomparisons that finds our method to be a significant improvement over\ntext-only prompts.\n</p>","author":null,"categories":[],"comments":null,"enclosure":null,"guid":null,"pub_date":null,"source":null,"content":null,"extensions":{},"itunes_ext":null,"dublin_core_ext":{"contributors":[],"coverages":[],"creators":["<a href=\"http://arxiv.org/find/cs/1/au:+Mello_R/0/1/0/all/0/1\">Rodrigo Mello</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Calegario_F/0/1/0/all/0/1\">Filipe Calegario</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Ramalho_G/0/1/0/all/0/1\">Geber Ramalho</a>"],"dates":[],"descriptions":[],"formats":[],"identifiers":[],"languages":[],"publishers":[],"relations":[],"rights":[],"sources":[],"subjects":[],"titles":[],"types":[]}},{"title":"Is ChatGPT a Good NLG Evaluator? A Preliminary Study. (arXiv:2303.04048v1 [cs.CL])","link":"http://arxiv.org/abs/2303.04048","description":"<p>Recently, the emergence of ChatGPT has attracted wide attention from the\ncomputational linguistics community. Many prior studies have shown that ChatGPT\nachieves remarkable performance on various NLP tasks in terms of automatic\nevaluation metrics. However, the ability of ChatGPT to serve as an evaluation\nmetric is still underexplored. Considering assessing the quality of NLG models\nis an arduous task and previous statistical metrics notoriously show their poor\ncorrelation with human judgments, we wonder whether ChatGPT is a good NLG\nevaluation metric. In this report, we provide a preliminary meta-evaluation on\nChatGPT to show its reliability as an NLG metric. In detail, we regard ChatGPT\nas a human evaluator and give task-specific (e.g., summarization) and\naspect-specific (e.g., relevance) instruction to prompt ChatGPT to score the\ngeneration of NLG models. We conduct experiments on three widely-used NLG\nmeta-evaluation datasets (including summarization, story generation and\ndata-to-text tasks). Experimental results show that compared with previous\nautomatic metrics, ChatGPT achieves state-of-the-art or competitive correlation\nwith golden human judgments. We hope our preliminary study could prompt the\nemergence of a general-purposed reliable NLG metric.\n</p>","author":null,"categories":[],"comments":null,"enclosure":null,"guid":null,"pub_date":null,"source":null,"content":null,"extensions":{},"itunes_ext":null,"dublin_core_ext":{"contributors":[],"coverages":[],"creators":["<a href=\"http://arxiv.org/find/cs/1/au:+Wang_J/0/1/0/all/0/1\">Jiaan Wang</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Liang_Y/0/1/0/all/0/1\">Yunlong Liang</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Meng_F/0/1/0/all/0/1\">Fandong Meng</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Shi_H/0/1/0/all/0/1\">Haoxiang Shi</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Li_Z/0/1/0/all/0/1\">Zhixu Li</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Xu_J/0/1/0/all/0/1\">Jinan Xu</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Qu_J/0/1/0/all/0/1\">Jianfeng Qu</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Zhou_J/0/1/0/all/0/1\">Jie Zhou</a>"],"dates":[],"descriptions":[],"formats":[],"identifiers":[],"languages":[],"publishers":[],"relations":[],"rights":[],"sources":[],"subjects":[],"titles":[],"types":[]}},{"title":"Describe me an Aucklet: Generating Grounded Perceptual Category Descriptions. (arXiv:2303.04053v1 [cs.CL])","link":"http://arxiv.org/abs/2303.04053","description":"<p>Human language users can generate descriptions of perceptual concepts beyond\ninstance-level representations and also use such descriptions to learn\nprovisional class-level representations. However, the ability of computational\nmodels to learn and operate with class representations is under-investigated in\nthe language-and-vision field. In this paper, we train separate neural networks\nto generate and interpret class-level descriptions. We then use the zero-shot\nclassification performance of the interpretation model as a measure of\ncommunicative success and class-level conceptual grounding. We investigate the\nperformance of prototype- and exemplar-based neural representations grounded\ncategory description. Finally, we show that communicative success reveals\nperformance issues in the generation model that are not captured by traditional\nintrinsic NLG evaluation metrics, and argue that these issues can be traced to\na failure to properly ground language in vision at the class level. We observe\nthat the interpretation model performs better with descriptions that are low in\ndiversity on the class level, possibly indicating a strong reliance on\nfrequently occurring features.\n</p>","author":null,"categories":[],"comments":null,"enclosure":null,"guid":null,"pub_date":null,"source":null,"content":null,"extensions":{},"itunes_ext":null,"dublin_core_ext":{"contributors":[],"coverages":[],"creators":["<a href=\"http://arxiv.org/find/cs/1/au:+Noble_B/0/1/0/all/0/1\">Bill Noble</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Ilinykh_N/0/1/0/all/0/1\">Nikolai Ilinykh</a>"],"dates":[],"descriptions":[],"formats":[],"identifiers":[],"languages":[],"publishers":[],"relations":[],"rights":[],"sources":[],"subjects":[],"titles":[],"types":[]}},{"title":"Visual Abstraction and Reasoning through Language. (arXiv:2303.04091v1 [cs.AI])","link":"http://arxiv.org/abs/2303.04091","description":"<p>While Artificial Intelligence (AI) models have achieved human or even\nsuperhuman performance in narrowly defined applications, they still struggle to\nshow signs of broader and more flexible intelligence. The Abstraction and\nReasoning Corpus (ARC), introduced by Fran\\c{c}ois Chollet, aims to assess how\nclose AI systems are to human-like cognitive abilities. Most current approaches\nrely on carefully handcrafted domain-specific languages (DSLs), which are used\nto brute-force solutions to the tasks present in ARC. In this work, we propose\na general framework for solving ARC based on natural language descriptions of\nthe tasks. While not yet beating state-of-the-art DSL models on ARC, we\ndemonstrate the immense potential of our approach hinted at by the ability to\nsolve previously unsolved tasks.\n</p>","author":null,"categories":[],"comments":null,"enclosure":null,"guid":null,"pub_date":null,"source":null,"content":null,"extensions":{},"itunes_ext":null,"dublin_core_ext":{"contributors":[],"coverages":[],"creators":["<a href=\"http://arxiv.org/find/cs/1/au:+Camposampiero_G/0/1/0/all/0/1\">Giacomo Camposampiero</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Houmard_L/0/1/0/all/0/1\">Loic Houmard</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Estermann_B/0/1/0/all/0/1\">Benjamin Estermann</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Mathys_J/0/1/0/all/0/1\">Jo&#xeb;l Mathys</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Wattenhofer_R/0/1/0/all/0/1\">Roger Wattenhofer</a>"],"dates":[],"descriptions":[],"formats":[],"identifiers":[],"languages":[],"publishers":[],"relations":[],"rights":[],"sources":[],"subjects":[],"titles":[],"types":[]}},{"title":"CroCoSum: A Benchmark Dataset for Cross-Lingual Code-Switched Summarization. (arXiv:2303.04092v1 [cs.CL])","link":"http://arxiv.org/abs/2303.04092","description":"<p>Cross-lingual summarization (CLS) has attracted increasing interest in recent\nyears due to the availability of large-scale web-mined datasets and the\nadvancements of multilingual language models. However, given the rareness of\nnaturally occurring CLS resources, the majority of datasets are forced to rely\non translation which can contain overly literal artifacts. This restricts our\nability to observe naturally occurring CLS pairs that capture organic diction,\nincluding instances of code-switching. This alteration between languages in\nmid-message is a common phenomenon in multilingual settings yet has been\nlargely overlooked in cross-lingual contexts due to data scarcity. To address\nthis gap, we introduce CroCoSum, a dataset of cross-lingual code-switched\nsummarization of technology news. It consists of over 24,000 English source\narticles and 18,000 human-curated Chinese news summaries, with more than 92% of\nthe summaries containing code-switched phrases. For reference, we evaluate the\nperformance of existing approaches including pipeline, end-to-end, and\nzero-shot methods. We show that leveraging existing resources as a pretraining\nstep does not improve performance on CroCoSum, indicating the limited\ngeneralizability of existing resources. Finally, we discuss the challenges of\nevaluating cross-lingual summarizers on code-switched generation through\nqualitative error analyses. Our collection and code can be accessed at\nhttps://github.com/RosenZhang/CroCoSum.\n</p>","author":null,"categories":[],"comments":null,"enclosure":null,"guid":null,"pub_date":null,"source":null,"content":null,"extensions":{},"itunes_ext":null,"dublin_core_ext":{"contributors":[],"coverages":[],"creators":["<a href=\"http://arxiv.org/find/cs/1/au:+Zhang_R/0/1/0/all/0/1\">Ruochen Zhang</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Eickhoff_C/0/1/0/all/0/1\">Carsten Eickhoff</a>"],"dates":[],"descriptions":[],"formats":[],"identifiers":[],"languages":[],"publishers":[],"relations":[],"rights":[],"sources":[],"subjects":[],"titles":[],"types":[]}},{"title":"Marpa and nullable symbols. (arXiv:2303.04093v1 [cs.CL])","link":"http://arxiv.org/abs/2303.04093","description":"<p>The Marpa parser was intended to make the best results in the academic\nliterature on Earley's algorithm available as a practical general parser.\nEarley-based parsers have had issues handling nullable symbols. Initially, we\ndealt with nullable symbols by following the approach in Aycock and Horspool's\n2002 paper. This paper reports our experience with the approach in that paper,\nand the approach to handling nullables that we settled on in reaction to that\nexperience.\n</p>","author":null,"categories":[],"comments":null,"enclosure":null,"guid":null,"pub_date":null,"source":null,"content":null,"extensions":{},"itunes_ext":null,"dublin_core_ext":{"contributors":[],"coverages":[],"creators":["<a href=\"http://arxiv.org/find/cs/1/au:+Kegler_J/0/1/0/all/0/1\">Jeffrey Kegler</a>"],"dates":[],"descriptions":[],"formats":[],"identifiers":[],"languages":[],"publishers":[],"relations":[],"rights":[],"sources":[],"subjects":[],"titles":[],"types":[]}},{"title":"Exploiting Asymmetry for Synthetic Training Data Generation: SynthIE and the Case of Information Extraction. (arXiv:2303.04132v1 [cs.CL])","link":"http://arxiv.org/abs/2303.04132","description":"<p>Large language models (LLMs) show great potential for synthetic data\ngeneration. This work shows that useful data can be synthetically generated\neven for tasks that cannot be solved directly by the LLM: we show that, for\nproblems with structured outputs, it is possible to prompt an LLM to perform\nthe task in the opposite direction, to generate plausible text for the target\nstructure. Leveraging the asymmetry in task difficulty makes it possible to\nproduce large-scale, high-quality data for complex tasks. We demonstrate the\neffectiveness of this approach on closed information extraction, where\ncollecting ground-truth data is challenging, and no satisfactory dataset exists\nto date. We synthetically generate a dataset of 1.8M data points, demonstrate\nits superior quality compared to existing datasets in a human evaluation and\nuse it to finetune small models (220M and 770M parameters). The models we\nintroduce, SynthIE, outperform existing baselines of comparable size with a\nsubstantial gap of 57 and 79 absolute points in micro and macro F1,\nrespectively. Code, data, and models are available at\nhttps://github.com/epfl-dlab/SynthIE.\n</p>","author":null,"categories":[],"comments":null,"enclosure":null,"guid":null,"pub_date":null,"source":null,"content":null,"extensions":{},"itunes_ext":null,"dublin_core_ext":{"contributors":[],"coverages":[],"creators":["<a href=\"http://arxiv.org/find/cs/1/au:+Josifoski_M/0/1/0/all/0/1\">Martin Josifoski</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Sakota_M/0/1/0/all/0/1\">Marija Sakota</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Peyrard_M/0/1/0/all/0/1\">Maxime Peyrard</a>, <a href=\"http://arxiv.org/find/cs/1/au:+West_R/0/1/0/all/0/1\">Robert West</a>"],"dates":[],"descriptions":[],"formats":[],"identifiers":[],"languages":[],"publishers":[],"relations":[],"rights":[],"sources":[],"subjects":[],"titles":[],"types":[]}},{"title":"A Hybrid Architecture for Out of Domain Intent Detection and Intent Discovery. (arXiv:2303.04134v1 [cs.CL])","link":"http://arxiv.org/abs/2303.04134","description":"<p>Intent Detection is one of the tasks of the Natural Language Understanding\n(NLU) unit in task-oriented dialogue systems. Out of Scope (OOS) and Out of\nDomain (OOD) inputs may run these systems into a problem. On the other side, a\nlabeled dataset is needed to train a model for Intent Detection in\ntask-oriented dialogue systems. The creation of a labeled dataset is\ntime-consuming and needs human resources. The purpose of this article is to\naddress mentioned problems. The task of identifying OOD/OOS inputs is named\nOOD/OOS Intent Detection. Also, discovering new intents and pseudo-labeling of\nOOD inputs is well known by Intent Discovery. In OOD intent detection part, we\nmake use of a Variational Autoencoder to distinguish between known and unknown\nintents independent of input data distribution. After that, an unsupervised\nclustering method is used to discover different unknown intents underlying\nOOD/OOS inputs. We also apply a non-linear dimensionality reduction on OOD/OOS\nrepresentations to make distances between representations more meaning full for\nclustering. Our results show that the proposed model for both OOD/OOS Intent\nDetection and Intent Discovery achieves great results and passes baselines in\nEnglish and Persian languages.\n</p>","author":null,"categories":[],"comments":null,"enclosure":null,"guid":null,"pub_date":null,"source":null,"content":null,"extensions":{},"itunes_ext":null,"dublin_core_ext":{"contributors":[],"coverages":[],"creators":["<a href=\"http://arxiv.org/find/cs/1/au:+Akbari_M/0/1/0/all/0/1\">Masoud Akbari</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Mohades_A/0/1/0/all/0/1\">Ali Mohades</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Shirali_Shahreza_M/0/1/0/all/0/1\">M. Hassan Shirali-Shahreza</a>"],"dates":[],"descriptions":[],"formats":[],"identifiers":[],"languages":[],"publishers":[],"relations":[],"rights":[],"sources":[],"subjects":[],"titles":[],"types":[]}},{"title":"Self-Consistency Improves Chain of Thought Reasoning in Language Models. (arXiv:2203.11171v4 [cs.CL] UPDATED)","link":"http://arxiv.org/abs/2203.11171","description":"<p>Chain-of-thought prompting combined with pre-trained large language models\nhas achieved encouraging results on complex reasoning tasks. In this paper, we\npropose a new decoding strategy, self-consistency, to replace the naive greedy\ndecoding used in chain-of-thought prompting. It first samples a diverse set of\nreasoning paths instead of only taking the greedy one, and then selects the\nmost consistent answer by marginalizing out the sampled reasoning paths.\nSelf-consistency leverages the intuition that a complex reasoning problem\ntypically admits multiple different ways of thinking leading to its unique\ncorrect answer. Our extensive empirical evaluation shows that self-consistency\nboosts the performance of chain-of-thought prompting with a striking margin on\na range of popular arithmetic and commonsense reasoning benchmarks, including\nGSM8K (+17.9%), SVAMP (+11.0%), AQuA (+12.2%), StrategyQA (+6.4%) and\nARC-challenge (+3.9%).\n</p>","author":null,"categories":[],"comments":null,"enclosure":null,"guid":null,"pub_date":null,"source":null,"content":null,"extensions":{},"itunes_ext":null,"dublin_core_ext":{"contributors":[],"coverages":[],"creators":["<a href=\"http://arxiv.org/find/cs/1/au:+Wang_X/0/1/0/all/0/1\">Xuezhi Wang</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Wei_J/0/1/0/all/0/1\">Jason Wei</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Schuurmans_D/0/1/0/all/0/1\">Dale Schuurmans</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Le_Q/0/1/0/all/0/1\">Quoc Le</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Chi_E/0/1/0/all/0/1\">Ed Chi</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Narang_S/0/1/0/all/0/1\">Sharan Narang</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Chowdhery_A/0/1/0/all/0/1\">Aakanksha Chowdhery</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Zhou_D/0/1/0/all/0/1\">Denny Zhou</a>"],"dates":[],"descriptions":[],"formats":[],"identifiers":[],"languages":[],"publishers":[],"relations":[],"rights":[],"sources":[],"subjects":[],"titles":[],"types":[]}},{"title":"MultiViz: Towards Visualizing and Understanding Multimodal Models. (arXiv:2207.00056v3 [cs.LG] UPDATED)","link":"http://arxiv.org/abs/2207.00056","description":"<p>The promise of multimodal models for real-world applications has inspired\nresearch in visualizing and understanding their internal mechanics with the end\ngoal of empowering stakeholders to visualize model behavior, perform model\ndebugging, and promote trust in machine learning models. However, modern\nmultimodal models are typically black-box neural networks, which makes it\nchallenging to understand their internal mechanics. How can we visualize the\ninternal modeling of multimodal interactions in these models? Our paper aims to\nfill this gap by proposing MultiViz, a method for analyzing the behavior of\nmultimodal models by scaffolding the problem of interpretability into 4 stages:\n(1) unimodal importance: how each modality contributes towards downstream\nmodeling and prediction, (2) cross-modal interactions: how different modalities\nrelate with each other, (3) multimodal representations: how unimodal and\ncross-modal interactions are represented in decision-level features, and (4)\nmultimodal prediction: how decision-level features are composed to make a\nprediction. MultiViz is designed to operate on diverse modalities, models,\ntasks, and research areas. Through experiments on 8 trained models across 6\nreal-world tasks, we show that the complementary stages in MultiViz together\nenable users to (1) simulate model predictions, (2) assign interpretable\nconcepts to features, (3) perform error analysis on model misclassifications,\nand (4) use insights from error analysis to debug models. MultiViz is publicly\navailable, will be regularly updated with new interpretation tools and metrics,\nand welcomes inputs from the community.\n</p>","author":null,"categories":[],"comments":null,"enclosure":null,"guid":null,"pub_date":null,"source":null,"content":null,"extensions":{},"itunes_ext":null,"dublin_core_ext":{"contributors":[],"coverages":[],"creators":["<a href=\"http://arxiv.org/find/cs/1/au:+Liang_P/0/1/0/all/0/1\">Paul Pu Liang</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Lyu_Y/0/1/0/all/0/1\">Yiwei Lyu</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Chhablani_G/0/1/0/all/0/1\">Gunjan Chhablani</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Jain_N/0/1/0/all/0/1\">Nihal Jain</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Deng_Z/0/1/0/all/0/1\">Zihao Deng</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Wang_X/0/1/0/all/0/1\">Xingbo Wang</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Morency_L/0/1/0/all/0/1\">Louis-Philippe Morency</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Salakhutdinov_R/0/1/0/all/0/1\">Ruslan Salakhutdinov</a>"],"dates":[],"descriptions":[],"formats":[],"identifiers":[],"languages":[],"publishers":[],"relations":[],"rights":[],"sources":[],"subjects":[],"titles":[],"types":[]}},{"title":"LambdaKG: A Library for Pre-trained Language Model-Based Knowledge Graph Embeddings. (arXiv:2210.00305v2 [cs.CL] UPDATED)","link":"http://arxiv.org/abs/2210.00305","description":"<p>Knowledge Graphs (KGs) often have two characteristics: heterogeneous graph\nstructure and text-rich entity/relation information. Text-based KG embeddings\ncan represent entities by encoding descriptions with pre-trained language\nmodels, but no open-sourced library is specifically designed for KGs with PLMs\nat present. In this paper, we present LambdaKG, a library for KGE that equips\nwith many pre-trained language models (e.g., BERT, BART, T5, GPT-3), and\nsupports various tasks (e.g., knowledge graph completion, question answering,\nrecommendation, and knowledge probing). LambdaKG is publicly open-sourced at\nhttps://github.com/zjunlp/PromptKG/tree/main/lambdaKG, with a demo video at\n<a href=\"http://deepke.zjukg.cn/lambdakg.mp4\">this http URL</a> and long-term maintenance.\n</p>","author":null,"categories":[],"comments":null,"enclosure":null,"guid":null,"pub_date":null,"source":null,"content":null,"extensions":{},"itunes_ext":null,"dublin_core_ext":{"contributors":[],"coverages":[],"creators":["<a href=\"http://arxiv.org/find/cs/1/au:+Xie_X/0/1/0/all/0/1\">Xin Xie</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Li_Z/0/1/0/all/0/1\">Zhoubo Li</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Wang_X/0/1/0/all/0/1\">Xiaohan Wang</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Zhu_Y/0/1/0/all/0/1\">Yuqi Zhu</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Zhang_N/0/1/0/all/0/1\">Ningyu Zhang</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Zhang_J/0/1/0/all/0/1\">Jintian Zhang</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Cheng_S/0/1/0/all/0/1\">Siyuan Cheng</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Tian_B/0/1/0/all/0/1\">Bozhong Tian</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Deng_S/0/1/0/all/0/1\">Shumin Deng</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Xiong_F/0/1/0/all/0/1\">Feiyu Xiong</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Chen_H/0/1/0/all/0/1\">Huajun Chen</a>"],"dates":[],"descriptions":[],"formats":[],"identifiers":[],"languages":[],"publishers":[],"relations":[],"rights":[],"sources":[],"subjects":[],"titles":[],"types":[]}},{"title":"ComSearch: Equation Searching with Combinatorial Strategy for Solving Math Word Problems with Weak Supervision. (arXiv:2210.07017v2 [cs.CL] UPDATED)","link":"http://arxiv.org/abs/2210.07017","description":"<p>Previous studies have introduced a weakly-supervised paradigm for solving\nmath word problems requiring only the answer value annotation. While these\nmethods search for correct value equation candidates as pseudo labels, they\nsearch among a narrow sub-space of the enormous equation space. To address this\nproblem, we propose a novel search algorithm with combinatorial strategy\n\\textbf{ComSearch}, which can compress the search space by excluding\nmathematically equivalent equations. The compression allows the searching\nalgorithm to enumerate all possible equations and obtain high-quality data. We\ninvestigate the noise in the pseudo labels that hold wrong mathematical logic,\nwhich we refer to as the \\textit{false-matching} problem, and propose a ranking\nmodel to denoise the pseudo labels. Our approach holds a flexible framework to\nutilize two existing supervised math word problem solvers to train pseudo\nlabels, and both achieve state-of-the-art performance in the weak supervision\ntask.\n</p>","author":null,"categories":[],"comments":null,"enclosure":null,"guid":null,"pub_date":null,"source":null,"content":null,"extensions":{},"itunes_ext":null,"dublin_core_ext":{"contributors":[],"coverages":[],"creators":["<a href=\"http://arxiv.org/find/cs/1/au:+Liu_Q/0/1/0/all/0/1\">Qianying Liu</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Guan_W/0/1/0/all/0/1\">Wenyu Guan</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Shen_J/0/1/0/all/0/1\">Jianhao Shen</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Cheng_F/0/1/0/all/0/1\">Fei Cheng</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Kurohashi_S/0/1/0/all/0/1\">Sadao Kurohashi</a>"],"dates":[],"descriptions":[],"formats":[],"identifiers":[],"languages":[],"publishers":[],"relations":[],"rights":[],"sources":[],"subjects":[],"titles":[],"types":[]}},{"title":"Inverse scaling can become U-shaped. (arXiv:2211.02011v4 [cs.CL] UPDATED)","link":"http://arxiv.org/abs/2211.02011","description":"<p>Scaling up language models has been empirically shown to improve performance\nand unlock emergent abilities. Conversely, observing worse performance as a\nfunction of scale (\"inverse scaling\") would indicate that scaling encourages\nbehaviors that are misaligned with human preferences. The Inverse Scaling Prize\n(McKenzie et al. 2022) identified eleven such inverse scaling tasks, evaluated\non models of up to 280B parameters and up to 500 zettaFLOPs of training\ncompute. This paper takes a closer look at these inverse scaling tasks. We\nevaluate models of up to 540B parameters, trained on five times more compute\nthan those evaluated in the Inverse Scaling Prize. With this increased range of\nmodel sizes and training compute, only four out of the eleven tasks remain\ninverse scaling. Six out of the eleven tasks exhibit what we call \"U-shaped\nscaling\" -- performance decreases up to a certain model size, and then\nincreases again up to the largest model evaluated (the one remaining task\ndisplays positive scaling). U-shaped scaling suggests that the inverse scaling\ntrend observed in McKenzie et al. (2022) may not continue to hold for larger\nmodels, and adds further support to the claim that sufficiently large models\nunlock emergent abilities.\n</p>","author":null,"categories":[],"comments":null,"enclosure":null,"guid":null,"pub_date":null,"source":null,"content":null,"extensions":{},"itunes_ext":null,"dublin_core_ext":{"contributors":[],"coverages":[],"creators":["<a href=\"http://arxiv.org/find/cs/1/au:+Wei_J/0/1/0/all/0/1\">Jason Wei</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Kim_N/0/1/0/all/0/1\">Najoung Kim</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Tay_Y/0/1/0/all/0/1\">Yi Tay</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Le_Q/0/1/0/all/0/1\">Quoc V. Le</a>"],"dates":[],"descriptions":[],"formats":[],"identifiers":[],"languages":[],"publishers":[],"relations":[],"rights":[],"sources":[],"subjects":[],"titles":[],"types":[]}},{"title":"Perceive and predict: self-supervised speech representation based loss functions for speech enhancement. (arXiv:2301.04388v2 [cs.SD] UPDATED)","link":"http://arxiv.org/abs/2301.04388","description":"<p>Recent work in the domain of speech enhancement has explored the use of\nself-supervised speech representations to aid in the training of neural speech\nenhancement models. However, much of this work focuses on using the deepest or\nfinal outputs of self supervised speech representation models, rather than the\nearlier feature encodings. The use of self supervised representations in such a\nway is often not fully motivated. In this work it is shown that the distance\nbetween the feature encodings of clean and noisy speech correlate strongly with\npsychoacoustically motivated measures of speech quality and intelligibility, as\nwell as with human Mean Opinion Score (MOS) ratings. Experiments using this\ndistance as a loss function are performed and improved performance over the use\nof STFT spectrogram distance based loss as well as other common loss functions\nfrom speech enhancement literature is demonstrated using objective measures\nsuch as perceptual evaluation of speech quality (PESQ) and short-time objective\nintelligibility (STOI).\n</p>","author":null,"categories":[],"comments":null,"enclosure":null,"guid":null,"pub_date":null,"source":null,"content":null,"extensions":{},"itunes_ext":null,"dublin_core_ext":{"contributors":[],"coverages":[],"creators":["<a href=\"http://arxiv.org/find/cs/1/au:+Close_G/0/1/0/all/0/1\">George Close</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Ravenscroft_W/0/1/0/all/0/1\">William Ravenscroft</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Hain_T/0/1/0/all/0/1\">Thomas Hain</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Goetze_S/0/1/0/all/0/1\">Stefan Goetze</a>"],"dates":[],"descriptions":[],"formats":[],"identifiers":[],"languages":[],"publishers":[],"relations":[],"rights":[],"sources":[],"subjects":[],"titles":[],"types":[]}},{"title":"Dialogue State Distillation Network with Inter-slot Contrastive Learning for Dialogue State Tracking. (arXiv:2302.08220v2 [cs.CL] UPDATED)","link":"http://arxiv.org/abs/2302.08220","description":"<p>In task-oriented dialogue systems, Dialogue State Tracking (DST) aims to\nextract users' intentions from the dialogue history. Currently, most existing\napproaches suffer from error propagation and are unable to dynamically select\nrelevant information when utilizing previous dialogue states. Moreover, the\nrelations between the updates of different slots provide vital clues for DST.\nHowever, the existing approaches rely only on predefined graphs to indirectly\ncapture the relations. In this paper, we propose a Dialogue State Distillation\nNetwork (DSDN) to utilize relevant information of previous dialogue states and\nmigrate the gap of utilization between training and testing. Thus, it can\ndynamically exploit previous dialogue states and avoid introducing error\npropagation simultaneously. Further, we propose an inter-slot contrastive\nlearning loss to effectively capture the slot co-update relations from dialogue\ncontext. Experiments are conducted on the widely used MultiWOZ 2.0 and MultiWOZ\n2.1 datasets. The experimental results show that our proposed model achieves\nthe state-of-the-art performance for DST.\n</p>","author":null,"categories":[],"comments":null,"enclosure":null,"guid":null,"pub_date":null,"source":null,"content":null,"extensions":{},"itunes_ext":null,"dublin_core_ext":{"contributors":[],"coverages":[],"creators":["<a href=\"http://arxiv.org/find/cs/1/au:+Xu_J/0/1/0/all/0/1\">Jing Xu</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Song_D/0/1/0/all/0/1\">Dandan Song</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Liu_C/0/1/0/all/0/1\">Chong Liu</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Hui_S/0/1/0/all/0/1\">Siu Cheung Hui</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Li_F/0/1/0/all/0/1\">Fei Li</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Ju_Q/0/1/0/all/0/1\">Qiang Ju</a>, <a href=\"http://arxiv.org/find/cs/1/au:+He_X/0/1/0/all/0/1\">Xiaonan He</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Xie_J/0/1/0/all/0/1\">Jian Xie</a>"],"dates":[],"descriptions":[],"formats":[],"identifiers":[],"languages":[],"publishers":[],"relations":[],"rights":[],"sources":[],"subjects":[],"titles":[],"types":[]}},{"title":"Complex QA and language models hybrid architectures, Survey. (arXiv:2302.09051v2 [cs.CL] UPDATED)","link":"http://arxiv.org/abs/2302.09051","description":"<p>This paper provides a survey of the state of the art of hybrid language\nmodels architectures and strategies for \"complex\" question-answering (QA, CQA,\nCPS). Very large language models are good at leveraging public data on standard\nproblems but once you want to tackle more specific complex questions or\nproblems you may need specific architecture, knowledge, skills, tasks, methods,\nsensitive data, performance, human approval and versatile feedback... This\nsurvey extends findings from the robust community edited research papers BIG,\nBLOOM and HELM which open source, benchmark and analyze limits and challenges\nof large language models in terms of tasks complexity and strict evaluation on\naccuracy (e.g. fairness, robustness, toxicity, ...). It identifies the key\nelements used with Large Language Models (LLM) to solve complex questions or\nproblems. Recent projects like ChatGPT and GALACTICA have allowed\nnon-specialists to grasp the great potential as well as the equally strong\nlimitations of language models in complex QA. Hybridizing these models with\ndifferent components could allow to overcome these different limits and go much\nfurther. We discuss some challenges associated with complex QA, including\ndomain adaptation, decomposition and efficient multi-step QA, long form QA,\nnon-factoid QA, safety and multi-sensitivity data protection, multimodal\nsearch, hallucinations, QA explainability and truthfulness, time dimension.\nTherefore we review current solutions and promising strategies, using elements\nsuch as hybrid LLM architectures, human-in-the-loop reinforcement learning,\nprompting adaptation, neuro-symbolic and structured knowledge grounding,\nprogram synthesis, and others. We analyze existing solutions and provide an\noverview of the current research and trends in the area of complex QA.\n</p>","author":null,"categories":[],"comments":null,"enclosure":null,"guid":null,"pub_date":null,"source":null,"content":null,"extensions":{},"itunes_ext":null,"dublin_core_ext":{"contributors":[],"coverages":[],"creators":["<a href=\"http://arxiv.org/find/cs/1/au:+Daull_X/0/1/0/all/0/1\">Xavier Daull</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Bellot_P/0/1/0/all/0/1\">Patrice Bellot</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Bruno_E/0/1/0/all/0/1\">Emmanuel Bruno</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Martin_V/0/1/0/all/0/1\">Vincent Martin</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Murisasco_E/0/1/0/all/0/1\">Elisabeth Murisasco</a>"],"dates":[],"descriptions":[],"formats":[],"identifiers":[],"languages":[],"publishers":[],"relations":[],"rights":[],"sources":[],"subjects":[],"titles":[],"types":[]}},{"title":"Knowledge-aware Bayesian Co-attention for Multimodal Emotion Recognition. (arXiv:2302.09856v3 [cs.CL] UPDATED)","link":"http://arxiv.org/abs/2302.09856","description":"<p>Multimodal emotion recognition is a challenging research area that aims to\nfuse different modalities to predict human emotion. However, most existing\nmodels that are based on attention mechanisms have difficulty in learning\nemotionally relevant parts on their own. To solve this problem, we propose to\nincorporate external emotion-related knowledge in the co-attention based fusion\nof pre-trained models. To effectively incorporate this knowledge, we enhance\nthe co-attention model with a Bayesian attention module (BAM) where a prior\ndistribution is estimated using the emotion-related knowledge. Experimental\nresults on the IEMOCAP dataset show that the proposed approach can outperform\nseveral state-of-the-art approaches by at least 0.7% unweighted accuracy (UA).\n</p>","author":null,"categories":[],"comments":null,"enclosure":null,"guid":null,"pub_date":null,"source":null,"content":null,"extensions":{},"itunes_ext":null,"dublin_core_ext":{"contributors":[],"coverages":[],"creators":["<a href=\"http://arxiv.org/find/cs/1/au:+Zhao_Z/0/1/0/all/0/1\">Zihan Zhao</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Wang_Y/0/1/0/all/0/1\">Yu Wang</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Wang_Y/0/1/0/all/0/1\">Yanfeng Wang</a>"],"dates":[],"descriptions":[],"formats":[],"identifiers":[],"languages":[],"publishers":[],"relations":[],"rights":[],"sources":[],"subjects":[],"titles":[],"types":[]}},{"title":"Can discrete information extraction prompts generalize across language models?. (arXiv:2302.09865v2 [cs.CL] UPDATED)","link":"http://arxiv.org/abs/2302.09865","description":"<p>We study whether automatically-induced prompts that effectively extract\ninformation from a language model can also be used, out-of-the-box, to probe\nother language models for the same information. After confirming that discrete\nprompts induced with the AutoPrompt algorithm outperform manual and semi-manual\nprompts on the slot-filling task, we demonstrate a drop in performance for\nAutoPrompt prompts learned on a model and tested on another. We introduce a way\nto induce prompts by mixing language models at training time that results in\nprompts that generalize well across models. We conduct an extensive analysis of\nthe induced prompts, finding that the more general prompts include a larger\nproportion of existing English words and have a less order-dependent and more\nuniform distribution of information across their component tokens. Our work\nprovides preliminary evidence that it's possible to generate discrete prompts\nthat can be induced once and used with a number of different models, and gives\ninsights on the properties characterizing such prompts.\n</p>","author":null,"categories":[],"comments":null,"enclosure":null,"guid":null,"pub_date":null,"source":null,"content":null,"extensions":{},"itunes_ext":null,"dublin_core_ext":{"contributors":[],"coverages":[],"creators":["<a href=\"http://arxiv.org/find/cs/1/au:+Rakotonirina_N/0/1/0/all/0/1\">Nathana&#xeb;l Carraz Rakotonirina</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Dessi_R/0/1/0/all/0/1\">Roberto Dess&#xec;</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Petroni_F/0/1/0/all/0/1\">Fabio Petroni</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Riedel_S/0/1/0/all/0/1\">Sebastian Riedel</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Baroni_M/0/1/0/all/0/1\">Marco Baroni</a>"],"dates":[],"descriptions":[],"formats":[],"identifiers":[],"languages":[],"publishers":[],"relations":[],"rights":[],"sources":[],"subjects":[],"titles":[],"types":[]}},{"title":"Learning Deep Semantics for Test Completion. (arXiv:2302.10166v3 [cs.SE] UPDATED)","link":"http://arxiv.org/abs/2302.10166","description":"<p>Writing tests is a time-consuming yet essential task during software\ndevelopment. We propose to leverage recent advances in deep learning for text\nand code generation to assist developers in writing tests. We formalize the\nnovel task of test completion to automatically complete the next statement in a\ntest method based on the context of prior statements and the code under test.\nWe develop TeCo -- a deep learning model using code semantics for test\ncompletion. The key insight underlying TeCo is that predicting the next\nstatement in a test method requires reasoning about code execution, which is\nhard to do with only syntax-level data that existing code completion models\nuse. TeCo extracts and uses six kinds of code semantics data, including the\nexecution result of prior statements and the execution context of the test\nmethod. To provide a testbed for this new task, as well as to evaluate TeCo, we\ncollect a corpus of 130,934 test methods from 1,270 open-source Java projects.\nOur results show that TeCo achieves an exact-match accuracy of 18, which is 29%\nhigher than the best baseline using syntax-level data only. When measuring\nfunctional correctness of generated next statement, TeCo can generate runnable\ncode in 29% of the cases compared to 18% obtained by the best baseline.\nMoreover, TeCo is significantly better than prior work on test oracle\ngeneration.\n</p>","author":null,"categories":[],"comments":null,"enclosure":null,"guid":null,"pub_date":null,"source":null,"content":null,"extensions":{},"itunes_ext":null,"dublin_core_ext":{"contributors":[],"coverages":[],"creators":["<a href=\"http://arxiv.org/find/cs/1/au:+Nie_P/0/1/0/all/0/1\">Pengyu Nie</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Banerjee_R/0/1/0/all/0/1\">Rahul Banerjee</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Li_J/0/1/0/all/0/1\">Junyi Jessy Li</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Mooney_R/0/1/0/all/0/1\">Raymond J. Mooney</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Gligoric_M/0/1/0/all/0/1\">Milos Gligoric</a>"],"dates":[],"descriptions":[],"formats":[],"identifiers":[],"languages":[],"publishers":[],"relations":[],"rights":[],"sources":[],"subjects":[],"titles":[],"types":[]}},{"title":"STACC: Code Comment Classification using SentenceTransformers. (arXiv:2302.13149v2 [cs.SE] UPDATED)","link":"http://arxiv.org/abs/2302.13149","description":"<p>Code comments are a key resource for information about software artefacts.\nDepending on the use case, only some types of comments are useful. Thus,\nautomatic approaches to classify these comments have been proposed. In this\nwork, we address this need by proposing, STACC, a set of\nSentenceTransformers-based binary classifiers. These lightweight classifiers\nare trained and tested on the NLBSE Code Comment Classification tool\ncompetition dataset, and surpass the baseline by a significant margin,\nachieving an average F1 score of 0.74 against the baseline of 0.31, which is an\nimprovement of 139%. A replication package, as well as the models themselves,\nare publicly available.\n</p>","author":null,"categories":[],"comments":null,"enclosure":null,"guid":null,"pub_date":null,"source":null,"content":null,"extensions":{},"itunes_ext":null,"dublin_core_ext":{"contributors":[],"coverages":[],"creators":["<a href=\"http://arxiv.org/find/cs/1/au:+Al_Kaswan_A/0/1/0/all/0/1\">Ali Al-Kaswan</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Izadi_M/0/1/0/all/0/1\">Maliheh Izadi</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Deursen_A/0/1/0/all/0/1\">Arie van Deursen</a>"],"dates":[],"descriptions":[],"formats":[],"identifiers":[],"languages":[],"publishers":[],"relations":[],"rights":[],"sources":[],"subjects":[],"titles":[],"types":[]}},{"title":"MuAViC: A Multilingual Audio-Visual Corpus for Robust Speech Recognition and Robust Speech-to-Text Translation. (arXiv:2303.00628v2 [cs.CL] UPDATED)","link":"http://arxiv.org/abs/2303.00628","description":"<p>We introduce MuAViC, a multilingual audio-visual corpus for robust speech\nrecognition and robust speech-to-text translation providing 1200 hours of\naudio-visual speech in 9 languages. It is fully transcribed and covers 6\nEnglish-to-X translation as well as 6 X-to-English translation directions. To\nthe best of our knowledge, this is the first open benchmark for audio-visual\nspeech-to-text translation and the largest open benchmark for multilingual\naudio-visual speech recognition. Our baseline results show that MuAViC is\neffective for building noise-robust speech recognition and translation models.\nWe make the corpus available at https://github.com/facebookresearch/muavic.\n</p>","author":null,"categories":[],"comments":null,"enclosure":null,"guid":null,"pub_date":null,"source":null,"content":null,"extensions":{},"itunes_ext":null,"dublin_core_ext":{"contributors":[],"coverages":[],"creators":["<a href=\"http://arxiv.org/find/cs/1/au:+Anwar_M/0/1/0/all/0/1\">Mohamed Anwar</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Shi_B/0/1/0/all/0/1\">Bowen Shi</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Goswami_V/0/1/0/all/0/1\">Vedanuj Goswami</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Hsu_W/0/1/0/all/0/1\">Wei-Ning Hsu</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Pino_J/0/1/0/all/0/1\">Juan Pino</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Wang_C/0/1/0/all/0/1\">Changhan Wang</a>"],"dates":[],"descriptions":[],"formats":[],"identifiers":[],"languages":[],"publishers":[],"relations":[],"rights":[],"sources":[],"subjects":[],"titles":[],"types":[]}},{"title":"Can ChatGPT Assess Human Personalities? A General Evaluation Framework. (arXiv:2303.01248v2 [cs.CL] UPDATED)","link":"http://arxiv.org/abs/2303.01248","description":"<p>Large Language Models (LLMs) especially ChatGPT have produced impressive\nresults in various areas, but their potential human-like psychology is still\nlargely unexplored. Existing works study the virtual personalities of LLMs but\nrarely explore the possibility of analyzing human personalities via LLMs. This\npaper presents a generic evaluation framework for LLMs to assess human\npersonalities based on Myers Briggs Type Indicator (MBTI) tests. Specifically,\nwe first devise unbiased prompts by randomly permuting options in MBTI\nquestions and adopt the average testing result to encourage more impartial\nanswer generation. Then, we propose to replace the subject in question\nstatements to enable flexible queries and assessments on different subjects\nfrom LLMs. Finally, we re-formulate the question instructions in a manner of\ncorrectness evaluation to facilitate LLMs to generate clearer responses. The\nproposed framework enables LLMs to flexibly assess personalities of different\ngroups of people. We further propose three evaluation metrics to measure the\nconsistency, robustness, and fairness of assessment results from\nstate-of-the-art LLMs including ChatGPT and InstructGPT. Our experiments reveal\nChatGPT's ability to assess human personalities, and the average results\ndemonstrate that it can achieve more consistent and fairer assessments in spite\nof lower robustness against prompt biases compared with InstructGPT.\n</p>","author":null,"categories":[],"comments":null,"enclosure":null,"guid":null,"pub_date":null,"source":null,"content":null,"extensions":{},"itunes_ext":null,"dublin_core_ext":{"contributors":[],"coverages":[],"creators":["<a href=\"http://arxiv.org/find/cs/1/au:+Rao_H/0/1/0/all/0/1\">Haocong Rao</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Leung_C/0/1/0/all/0/1\">Cyril Leung</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Miao_C/0/1/0/all/0/1\">Chunyan Miao</a>"],"dates":[],"descriptions":[],"formats":[],"identifiers":[],"languages":[],"publishers":[],"relations":[],"rights":[],"sources":[],"subjects":[],"titles":[],"types":[]}}],"extensions":{},"itunes_ext":null,"dublin_core_ext":{"contributors":[],"coverages":[],"creators":[],"dates":["2023-03-07T20:30:00-05:00"],"descriptions":[],"formats":[],"identifiers":[],"languages":["en-us"],"publishers":["help@arxiv.org"],"relations":[],"rights":[],"sources":[],"subjects":["Computer Science -- Computation and Language"],"titles":[],"types":[]},"syndication_ext":{"period":"DAILY","frequency":1,"base":"1901-01-01T00:00+00:00"},"namespaces":{"syn":"http://purl.org/rss/1.0/modules/syndication/","dc":"http://purl.org/dc/elements/1.1/","admin":"http://webns.net/mvcb/","taxo":"http://purl.org/rss/1.0/modules/taxonomy/","rdf":"http://www.w3.org/1999/02/22-rdf-syntax-ns#","content":"http://purl.org/rss/1.0/modules/content/"}}]}]}